;;;; testing.lisp

(in-package #:mnas-graph)

(view-graph
 (generate-graph
  '(("a" "b") ("a" "c") ("a" "d") ("b" "c") ("c" "d"))))

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(view-graph
 (generate-graph
  '((#1="Ванцовский" #2="Коротич")
    (#2#             #4="Головерда")
    (#1#             #3="Петельчиц")
    (#3#             "Федоров")
    (#3#             "Снигирь")
    (#3#             "Тройннич")
    (#3#             "Зинченко")
    
    (#2#             "Рябов")
    (#2#             "Пивень")
    (#2#             "Банкулова")
    (#2#             "Матвеев")
    (#4#             "Иванов")
    (#2#             "Давлеткужин")
    (#4#             "Гришина"))))

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(defparameter *g*
  (view-graph
   (generate-graph
    (let ((lst nil))
      (dotimes (i 200 lst)
	(push (list
	       (format nil "~A" (random 200))
	       (format nil "~A" (random 200)))
	      lst))))))
    
(view-graph *g*)

